{
    "Three Musketeers": "Trio of powerful, independent markswomen, fighting for justice and honor. Disrespecting them would not be just a mistake, it would be a cardinal sin! Troop, Arena 7",
    "Golem": "Slow but durable, only attacks buildings. When destroyed, explosively splits into two Golemites and deals area damage! Troop, Arena 10",
    "Royal Recruits": "Deploys a line of recruits armed with spears, shields and wooden buckets. They dream of ponies and one day wearing metal buckets. Troop, Arena 7",
    "Lava Hound": "The Lava Hound is a majestic flying beast that attacks buildings. The Lava Pups are less majestic angry babies that attack anything. Troop, Arena 10",
    "P.E.K.K.A": "A heavily armored, slow melee fighter. Swings from the hip, but packs a huge punch. Troop, Arena 4",
    "Mega Knight": "He lands with the force of 1,000 mustaches, then jumps from one foe to the next dealing huge area damage. Stand aside! Troop, Arena 7",
    "Electro Giant": "He channels electricity through his Zap Pack, a unique device that stuns and damages any Troop attacking him within its range. Don't tell him that his finger guns aren't real! He'll zap you. Troop, Arena 11",
    "Sparky": "Sparky slowly charges up, then unloads MASSIVE area damage. Overkill isn't in her vocabulary. Troop, Arena 11",
    "Giant Skeleton": "The bigger the skeleton, the bigger the bomb. Carries a bomb that blows up when the Giant Skeleton dies. Troop, Arena 4",
    "Goblin Giant": "This jolly green Goblin Giant stomps towards enemy buildings. He carries two Spear Goblins everywhere he goes. It's a weird but functional arrangement. Troop, Arena 9",
    "Royal Giant": "Destroying enemy buildings with his massive cannon is his job; making a raggedy blond beard look good is his passion. Troop, Arena 7",
    "Elite Barbarians": "Spawns a pair of leveled up Barbarians. They're like regular Barbarians, only harder, better, faster and stronger. Troop, Arena 10",
    "Archer Queen": "She is fast, deadly and hard to catch. Beware of her crossbow bolts and try not to blink - you might miss her! Troop, Training Camp",
    "Ram Rider": "Together they charge through the Arena; snaring enemies, knocking down towers ... and chewing grass!? Troop, Arena 10",
    "Balloon": "As pretty as they are, you won't want a parade of THESE balloons showing up on the horizon. Drops powerful bombs and when shot down, crashes dealing area damage. Troop, Arena 6",
    "Witch": "Summons Skeletons, shoots destructo beams, has glowing pink eyes that unfortunately don't shoot lasers. Troop, Arena 5",
    "Prince": "Don't let the little pony fool you. Once the Prince gets a running start, you WILL be trampled. Deals double damage once he gets charging. Troop, Arena 7",
    "Bowler": "This big blue dude digs the simple things in life - Dark Elixir drinks and throwing rocks. His massive boulders roll through their target, hitting everything behind for a strike! Troop, Arena 13",
    "Executioner": "He throws his axe like a boomerang, striking all enemies on the way out AND back. It's a miracle he doesn't lose an arm. Troop, Arena 14",
    "Cannon Cart": "A Cannon on wheels?! Bet they won't see that coming! Once you break its shield, it becomes a Cannon not on wheels. Troop, Legendary Arena",
    "Electro Dragon": "Spits out bolts of electricity hitting up to three targets. Suffers from middle child syndrome to boot. Troop, Arena 11",
    "Giant": "Slow but durable, only attacks buildings. A real one-man wrecking crew! Troop, Training Camp",
    "Royal Hogs": "The King's personal pets are loose! They love to chomp on apples and towers alike - who let the hogs out?! Troop, Arena 7",
    "Wizard": "The most awesome man to ever set foot in the Arena, the Wizard will blow you away with his handsomeness... and/or fireballs. Troop, Arena 4",
    "Barbarians": "A horde of melee attackers with mean mustaches and even meaner tempers. Troop, Arena 3",
    "Minion Horde": "Six fast, unarmored flying attackers. Three's a crowd, six is a horde! Troop, Arena 10",
    "Rascals": "Spawns a mischievous trio of Rascals! The boy takes the lead, while the girls pelt enemies from behind... with slingshots full of Double Trouble Gum! Troop, Arena 13",
    "Skeleton King": "The King of the undead himself. He sometimes feels lonely (could be due to his non flattering features) and will summon friends to join him in the battle even after death. Tough guys have feelings too! Troop, Training Camp",
    "Golden Knight": "A warrior with luxurious hair and outstanding flexibility. Demonstrates his aerobics skills on demand. Troop, Arena 2",
    "Mighty Miner": "Walk softly... and carry a big drill! This Champion deals increasing Damage to his target and can switch lanes to escape combat or change attack plans. This makes him not only the mightiest, but also the sneakiest Miner in the Arena. Troop, Arena 2",
    "Lumberjack": "He chops trees by day and hunts The Log by night. His bottle of Rage spills everywhere when he's defeated. Troop, Arena 14",
    "Inferno Dragon": "Shoots a focused beam of fire that increases in damage over time. Wears a helmet because flying can be dangerous. Troop, Arena 9",
    "Night Witch": "Summons Bats to do her bidding! If you get too close, she's not afraid of pitching in with her mean-looking battle staff. Troop, Arena 14",
    "Magic Archer": "Not quite a Wizard, nor an Archer - he shoots a magic arrow that passes through and damages all enemies in its path. It's not a trick, it's magic! Troop, Arena 13",
    "Mother Witch": "Places a curse on enemy Troops with each attack. When a cursed Troop is destroyed, it turns into a building-targeting Hog that fights alongside the Mother Witch! She also bakes great cookies. Troop, Legendary Arena",
    "Baby Dragon": "Burps fireballs from the sky that deal area damage. Baby dragons hatch cute, hungry and ready for a barbeque. Troop, Arena 2",
    "Dark Prince": "The Dark Prince deals area damage and lets his spiked club do the talking for him - because when he does talk, it sounds like he has a bucket on his head. Troop, Arena 7",
    "Hunter": "He deals BIG damage up close - not so much at range. What he lacks in accuracy, he makes up for with his impressively bushy eyebrows. Troop, Arena 10",
    "Valkyrie": "Tough melee fighter, deals area damage around her. Swarm or horde, no problem! She can take them all out with a few spins. Troop, Arena 2",
    "Musketeer": "Don't be fooled by her delicately coiffed hair, the Musketeer is a mean shot with her trusty boomstick. Troop, Training Camp",
    "Mini P.E.K.K.A": "The Arena is a certified butterfly-free zone. No distractions for P.E.K.K.A, only destruction. Troop, Training Camp",
    "Hog Rider": "Fast melee troop that targets buildings and can jump over the river. He followed the echoing call of Hog Riderrrrr all the way through the Arena doors. Troop, Arena 5",
    "Battle Ram": "Two Barbarians holding a big log charge at the nearest building, dealing significant damage if they connect; then they go to town with their swords! Troop, Arena 3",
    "Zappies": "Spawns a pack of miniature Zap machines. Who controls them...? Only the Master Builder knows. Troop, Arena 11",
    "Flying Machine": "The Master Builder has sent his first contraption to the Arena! It's a fast and fun flying machine, but fragile! Troop, Arena 6",
    "Battle Healer": "With each attack, she unleashes a powerful healing aura that restores Hitpoints to herself and friendly Troops. When she isn't attacking, she passively heals herself! Troop, Legendary Arena",
    "Skeleton Dragons": "This pair of skeletal scorchers deal Area Damage and fly above the Arena. They also play a mean rib cage xylophone duet. Troop, Arena 4",
    "Ice Wizard": "This chill caster throws ice shards that slow down enemies' movement and attack speed. Despite being freezing cold, he has a handlebar mustache that's too hot for TV. Troop, Arena 8",
    "Princess": "This stunning Princess shoots flaming arrows from long range. If you're feeling warm feelings towards her, it's probably because you're on fire. Troop, Arena 5",
    "Miner": "The Miner can burrow his way underground and appear anywhere in the Arena. It's not magic, it's a shovel. A shovel that deals reduced damage to Crown Towers. Troop, Arena 4",
    "Bandit": "The Bandit dashes to her target and delivers an extra big hit! While dashing, she can't be touched. The mask keeps her identity safe, and gives her bonus cool points! Troop, Arena 13",
    "Royal Ghost": "He drifts invisibly through the Arena until he's startled by an enemy... then he attacks! Then he's invisible again! Zzzz. Troop, Arena 12",
    "Fisherman": "His Ranged Attack can pull enemies towards him, and pull himself to enemy buildings. He's also mastered the ancient art of 'Fish Slapping'. Troop, Legendary Arena",
    "Skeleton Army": "Spawns an army of Skeletons. Meet Larry and his friends Harry, Gerry, Terry, Mary, etc. Troop, Arena 2",
    "Guards": "Three ruthless bone brothers with shields. Knock off their shields and all that's left are three ruthless bone brothers. Troop, Arena 12",
    "Mega Minion": "Flying, armored and powerful. What could be its weakness?! Cupcakes. Troop, Arena 3",
    "Dart Goblin": "Runs fast, shoots far and chews gum. How does he blow darts with a mouthful of Double Trouble Gum? Years of didgeridoo lessons. Troop, Arena 9",
    "Elixir Golem": "Splits into two Elixir Golemites when destroyed, which split into two sentient Blobs when defeated. A Blob gives your opponent 1 Elixir when destroyed! Troop, Arena 14",
    "Knight": "A tough melee fighter. The Barbarian's handsome, cultured cousin. Rumor has it that he was knighted based on the sheer awesomeness of his mustache alone. Troop, Training Camp",
    "Archers": "A pair of lightly armored ranged attackers. They'll help you take down ground and air units, but you're on your own with hair coloring advice. Troop, Training Camp",
    "Minions": "Three fast, unarmored flying attackers. Roses are red, minions are blue, they can fly, and will crush you! Troop, Training Camp",
    "Goblin Gang": "Spawns five Goblins - three with knives, two with spears - at a discounted Elixir cost. It's like a Goblin Value Pack! Troop, Arena 9",
    "Skeleton Barrel": "It's a Skeleton party in the sky, until all the balloons pop... then it's a Skeleton party on the ground! Troop, Arena 12",
    "Firecracker": "Shoots a firework that explodes upon impact, damaging the target and showering anything directly behind it with sparks. This is what happens when Archers get bored! Troop, Arena 14",
    "Wall Breakers": "A daring duo of dangerous dive bombers. Nothing warms a Wall Breaker's cold and undead heart like blowing up buildings. Troop, Arena 5",
    "Ice Golem": "He's tough, targets buildings and explodes when destroyed, slowing nearby enemies. Made entirely out of ice... or is he?! Yes. Troop, Arena 8",
    "Goblins": "Three fast, unarmored melee attackers. Small, fast, green and mean! Troop, Arena 1",
    "Bomber": "Small, lightly protected skeleton who throws bombs. Deals area damage that can wipe out a swarm of enemies. Troop, Arena 2",
    "Spear Goblins": "Three unarmored ranged attackers. Who the heck taught these guys to throw spears!? Who thought that was a good idea?! Troop, Arena 1",
    "Bats": "Spawns a handful of tiny flying creatures. Think of them as sweet, purple... balls of DESTRUCTION! Troop, Arena 5",
    "Skeletons": "Three fast, very weak melee fighters. Surround your enemies with this pile of bones! Troop, Arena 2",
    "Ice Spirit": "Spawns one lively little Ice Spirit to freeze a group of enemies. Stay frosty. Troop, Arena 8",
    "Fire Spirit": "The Fire Spirit is on a kamikaze mission to give you a warm hug. It'd be adorable if it wasn't on fire. Troop, Arena 4",
    "Electro Spirit": "Jumps on enemies, dealing Area Damage and stunning up to 9 enemy Troops. Locked in an eternal battle with Knight for the best mustache. Troop, Arena 11",
    "Barbarian Hut": "Building that periodically spawns Barbarians to fight the enemy. Time to make the Barbarians! Building, Arena 14",
    "X-Bow": "Nice tower you got there. Would be a shame if this X-Bow whittled it down from this side of the Arena... Building, Arena 6",
    "Elixir Collector": "You gotta spend Elixir to make Elixir! This building makes 8 Elixir over its Lifetime. Does not appear in your starting hand. Building, Arena 13",
    "Goblin Hut": "Building that spawns Spear Goblins. Don't look inside... you don't want to see how they're made. Building, Arena 9",
    "Inferno Tower": "Defensive building, roasts targets for damage that increases over time. Burns through even the biggest and toughest enemies! Building, Arena 4",
    "Goblin Drill": "Building capable of burrowing underground and appearing anywhere in the Arena. Spawns Goblins one at a time until destroyed. Then spawns a few more, to make sure everything nearby has been properly stabbed. Building, Arena 13",
    "Bomb Tower": "Defensive building that houses a Bomber. Deals area damage to anything dumb enough to stand near it. Building, Arena 12",
    "Furnace": "The Furnace spawns one Fire Spirit at a time. It also makes great brick-oven pancakes. Building, Arena 10",
    "Goblin Cage": "When the Goblin Cage is destroyed, a Goblin Brawler is unleashed into the Arena! Goblin Brawler always skips leg day. Building, Arena 1",
    "Mortar": "Defensive building with a long range. Shoots big boulders that deal area damage, but cannot hit targets that get too close! Building, Arena 6",
    "Tesla": "Defensive building. Whenever it's not zapping the enemy, the power of Electrickery is best kept grounded. Building, Arena 11",
    "Tombstone": "Building that periodically spawns Skeletons to fight the enemy... and when destroyed, spawns 4 more Skeletons! Creepy! Building, Arena 2",
    "Cannon": "Defensive building. Shoots cannonballs with deadly effect, but cannot target flying troops. Building, Arena 3",
    "Lightning": "Bolts of lightning damage and stun up to three enemy troops or buildings with the most hitpoints in the target area. Reduced damage to Crown Towers. Spell, Arena 8",
    "Rocket": "Deals high damage to a small area. Looks really awesome doing it. Reduced damage to Crown Towers. Spell, Arena 6",
    "Graveyard": "Surprise! It's a party. A Skeleton party, anywhere in the Arena. Yay! Spell, Arena 12",
    "Freeze": "Freezes and damages enemy troops and buildings, making them unable to move or attack. Everybody chill. Reduced damage to Crown Towers. Spell, Arena 8",
    "Poison": "Covers the area in a deadly toxin, damaging enemy troops and buildings over time. Yet somehow leaves the grass green and healthy. Go figure! Reduced damage to Crown Towers. Spell, Arena 9",
    "Fireball": "Annnnnd... Fireball. Incinerates a small area, dealing high damage. Reduced damage to Crown Towers. Spell, Training Camp",
    "Goblin Barrel": "Spawns three Goblins anywhere in the Arena. It's going to be a thrilling ride, boys! Spell, Arena 3",
    "Tornado": "Drags enemy troops to its center while dealing damage over time, just like a magnet. A big, swirling, Tornado-y magnet. Spell, Legendary Arena",
    "Clone": "Duplicates all friendly troops in the target area. Cloned troops are fragile, but pack the same punch as the original! Doesn't affect buildings. Spell, Legendary Arena",
    "Earthquake": "Deals Damage per second to Troops and Crown Towers. Deals huge Building Damage! Does not affect flying units (it is an EARTHquake, after all). Spell, Arena 12",
    "Arrows": "Arrows pepper a large area, damaging all enemies hit. Reduced damage to Crown Towers. Spell, Training Camp",
    "Royal Delivery": "No need to sign for this package! Dropped from the sky, it deals Area Damage to enemy Troops before delivering a Royal Recruit. The empty box is also handy for espionage. Spell, Legendary Arena",
    "The Log": "A spilt bottle of Rage turned an innocent tree trunk into The Log. Now, it seeks revenge by crushing anything in its path! Reduced damage to Crown Towers. Spell, Arena 6",
    "Rage": "Increases troop movement and attack speed. Buildings attack faster and summon troops quicker, too. Chaaaarge! Spell, Arena 14",
    "Barbarian Barrel": "It rolls over and damages anything in its path, then breaks open and out pops a Barbarian! How did he get inside?! Spell, Arena 3",
    "Zap": "Zaps enemies, briefly stunning them and dealing damage inside a small radius. Reduced damage to Crown Towers. Spell, Arena 5",
    "Giant Snowball": "It's HUGE! Once it began rolling down Frozen Peak, there was no stopping it. Enemies hit are knocked back and slowed down. Reduced damage to Crown Towers. Spell, Arena 8",
    "Mirror": "Mirrors your last card played for +1 Elixir. Does not appear in your starting hand. Spell, Arena 12",
    "Heal Spirit": "A mischievous Spirit that leaps at enemies, dealing Damage and leaving behind a powerful healing effect that restores Hitpoints to friendly Troops! R.I.P. Heal 2017 - 2020 Alas, we hardly used ye. Spell, Arena 13"
}